package com.pchome.enumerate.billing;

public enum EnumBillingStatus {
	
	B101("未付款"),    		// 訂單成立，但是還沒決定付款方式

    B201("付款中"),    		// 信用卡授權等待確認中
    B202("付款中"),    		// 信用卡授權成功等待照會
    B203("付款中"),    		// ATM等付款

    B301("付款成功"),  		// 信用卡授權成功
    B302("付款成功"),  		// ATM轉帳已入帳

    B401("付款失敗"),  		// 信用卡授權失敗
    B402("付款失敗"),  		// 信用卡照會不符合資料
    B403("付款失敗"),  		// 信用卡訂單已成立未完成流程即關閉視窗
    B404("付款失敗"),  		// ATM轉帳逾時
    B405("付款失敗"),  		// ATM轉帳金額不符
    B406("付款失敗"),  		// ATM訂單已成立未完成流程即關閉視窗
    B407("付款失敗"),  		// 訂單成立，還沒決定付款方式，即關閉視窗
    B408("付款失敗"),  		// ATM 付款失敗

    B501("付款審核中"),		// 交易成功，其他錯誤
    B502("付款審核中"),		// 交易成功，認列開立失敗
    B503("付款審核中"),		// 交易成功，發票開立失敗
    B504("付款審核中"),		// 交易成功，認列金額錯誤
    B505("付款審核中"),		// 交易成功，需更新起訖日期

    R101("退款審核中"),		// 信用卡已收到退款申請進行退款作業
    R102("退款審核中"),		// ATM已收到退款申請進行退款作業
    R103("退款審核中"),		// 信用卡冒刷已收到退款申請進行退款作業

    R201("退款中"),    		// 信用卡一拿到會員寄回的憑證，直到等待退款完成
    R202("退款中"),    		// ATM一拿到會員寄回的憑證，直到等待退款完成
    R203("退款中"),    		// 信用卡冒刷一拿到會員寄回的憑證，直到等待退款完成

    R301("退款完成"),  		// 信用卡正常退款完成
    R302("退款完成"),  		// ATM已退款完成
    R303("退款完成"),  		// 信用卡冒刷退款完成

    R401("退款失敗"),  		// 信用卡已退款失敗
    R402("退款失敗"),  		// ATM已退款失敗
    R403("退款失敗"),  		// 信用卡冒刷退款失敗

    R501("退款審核成功"),	// 退款審核成功

    R601("退款審核失敗");	// 退款審核失敗
	
	private final String message;
	
	private EnumBillingStatus(String message){
		this.message = message;
	}

	public String getMessage() {
		return message;
	}
	
}
